In [3]:
import numpy as np 
import pandas as pd

In [4]:
d = {'A':[1, 2, np.nan], 'B': [5, np.nan, np.nan], 'C': [1, 2, 3]}

In [5]:
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [6]:
df = pd.DataFrame(d)

In [7]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [8]:
df.dropna(axis=1) #drop column with nan values

   C
0  1
1  2
2  3

In [9]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [10]:
df.dropna(axis=0) #drop rows with any nan values

     A    B  C
0  1.0  5.0  1

In [11]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [12]:
df.dropna() #do shift + tab to see args or parameters,,

     A    B  C
0  1.0  5.0  1

In [13]:
df.dropna(thresh=2) # drop rows with at least 2 nan

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [14]:
df.dropna(subset=['A']) #delete rows with nan but in specified columns

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [15]:
#by default how=any.. all drops columns or rows where all values are nan

In [16]:
df.dropna(axis=1, how='any')

   C
0  1
1  2
2  3

In [17]:
df.dropna(axis=1, how='all')

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [18]:
df.dropna(axis=0, how='all')

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [19]:
df.fillna(value='EMPTY')

       A      B  C
0    1.0    5.0  1
1    2.0  EMPTY  2
2  EMPTY  EMPTY  3

In [20]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [21]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [22]:
df.fillna('Hello') #the first arg is by default the VALUE

       A      B  C
0    1.0    5.0  1
1    2.0  Hello  2
2  Hello  Hello  3